{
  "backend/main.mo": "Motoko actor managing app state with screen navigation and balloon-popping logic, including validation and state queries.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of all major frontend files, screens, components, and hooks.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH variables, theming, dark mode values, and base element styles.",
  "frontend/index.html": "HTML entry loading Google Fonts and mounting the React app root for consistent typography on first paint.",
  "frontend/src/App.tsx": "Main React app orchestrating screen flow with fade transitions and guarded navigation using React Query provider.",
  "frontend/src/components/Balloon.tsx": "Balloon SVG component with float and pop animations, click handling, and popped-state display.",
  "frontend/src/components/Confetti.tsx": "Component generating 50 animated confetti pieces with randomized colors, timing, and falling behavior.",
  "frontend/src/components/FramedPhoto.tsx": "Photo component with royal-style frame, sparkles, load skeleton, and fallback handling for image errors.",
  "frontend/src/components/PrimaryCtaButton.tsx": "Reusable CTA button with themed variants and Tailwind styling wrapped around a base UI button.",
  "frontend/src/components/ZoomPanImage.tsx": "Image viewer with zoom, pan, reset controls, load states, error display, and gesture-based interaction.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and stored identity restoration using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in react-query hooks for fetching app state and running mutations.",
  "frontend/src/hooks/useZoomPan.ts": "Implements zoom and pan logic with wheel and pointer controls, managing scale and translation constraints.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, custom animations, and decorative styling including a gold frame.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/BalloonScreen.tsx": "Renders a balloon-popping mini game that advances after all balloons are popped.",
  "frontend/src/pages/CakeScreen.tsx": "Displays a birthday cake screen with confetti and a button leading to the balloon game.",
  "frontend/src/pages/FinalScreen.tsx": "Displays the final birthday screen with animated hearts, a message reveal, and a restart button.",
  "frontend/src/pages/HandwrittenNoteScreen.tsx": "Shows a decorative handwritten note card with sparkles and a button to proceed.",
  "frontend/src/pages/IntroScreen.tsx": "Intro page featuring a cute panda, birthday text, and a button to start the experience.",
  "frontend/src/pages/LoadingScreen.tsx": "Displays a loading animation with a progress bar before transitioning to the next screen.",
  "frontend/src/pages/MessageScreen1.tsx": "Interactive message card that reveals a photo and birthday message when opened, with a next button.",
  "frontend/src/pages/MessageScreen2.tsx": "Second interactive message card showing a photo, emojis, and a birthday greeting before continuing.",
  "frontend/src/pages/PreFinalLoadingScreen.tsx": "Pre-final loading screen with progress tracking and animated emojis before the final reveal.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, animations, shadows, and enabling plugin support.",
  "project_state.json": "Defines project metadata and a detailed list of existing interactive birthday‑app features, covering screen flow, animations, UI components, and backend intentions. Serves as the canonical state and feature registry for the project."
}