{
  "backend/main.mo": "Motoko actor managing app state with screen transitions and balloon popping logic, including validation and a getState query.",
  "feature_evidence.json": "Report listing feature tickets, related frontend files, components used, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components and pages.",
  "frontend/index.css": "Tailwind base and theme CSS defining color variables, dark mode overrides, and global styling.",
  "frontend/index.html": "HTML entry point loading Google Fonts and mounting the React app.",
  "frontend/src/App.tsx": "Main React app managing screen flow, fade transitions, and restart logic using state and refs.",
  "frontend/src/components/Balloon.tsx": "Balloon SVG component with popping animation and click handling.",
  "frontend/src/components/Confetti.tsx": "Generates falling confetti pieces with randomized positions, colors, and animation timings.",
  "frontend/src/components/FramedPhoto.tsx": "Displays a framed photo with skeleton loading, sparkles, and error fallback handling.",
  "frontend/src/components/PrimaryCtaButton.tsx": "Reusable CTA button wrapper applying themed styles and size/variant options.",
  "frontend/src/components/ZoomPanImage.tsx": "Image viewer with zoom, pan, reset controls, loading states, and gesture/mouse interaction via useZoomPan.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching authenticated or anonymous backend actors and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, and identity loading. Wraps AuthClient setup and exposes status flags through a custom hook.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching app state and performing screen and balloon mutations via the backend actor. Automatically refreshes state after mutations.",
  "frontend/src/hooks/useZoomPan.ts": "Implements zoom and pan gesture handling with scale limits, drag movement, and pointer/wheel event listeners. Returns state and controls like zoomIn, zoomOut, and reset.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, themes, animations, and decorative utility classes. Includes birthday-themed color tokens and styled frame effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering. Imports global styles.",
  "frontend/src/pages/BalloonScreen.tsx": "Renders an interactive balloon-popping screen that plays a pop sound and advances once all balloons are popped. Displays themed styling and a progress indicator.",
  "frontend/src/pages/CakeScreen.tsx": "Shows a birthday cake screen with confetti and a CTA button to proceed to the balloon screen. Uses animated visuals and themed styling.",
  "frontend/src/pages/FinalScreen.tsx": "Displays the final celebratory birthday message with floating hearts, animations, and a restart button. Reveals an additional message with a timed fade-in effect.",
  "frontend/src/pages/HandwrittenNoteScreen.tsx": "Displays a decorated handwritten note card with sparkles and a next button, using ZoomPanImage and themed gradients.",
  "frontend/src/pages/IntroScreen.tsx": "Shows an intro birthday screen with a panda image, celebratory text, and a button to start the experience.",
  "frontend/src/pages/LoadingScreen.tsx": "Implements a 3‑second loading screen with an animated progress bar and triggers onComplete when finished.",
  "frontend/src/pages/MessageScreen1.tsx": "Presents a tappable message card that expands to reveal a framed photo and birthday text, then shows a next button.",
  "frontend/src/pages/MessageScreen2.tsx": "Provides a second tappable message card with a photo, emojis, and a birthday message, followed by a next button.",
  "frontend/src/pages/PreFinalLoadingScreen.tsx": "Runs a short timed loading animation with a progress bar before transitioning to the next screen.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, shadows, animations, and enabling plugins for animate and typography.",
  "project_state.json": "Project metadata describing the birthday web app, architecture notes, known issues, and existing features."
}