{
  "kind": "build_request",
  "title": "Fix mobile/tablet/laptop responsive layout (FramedPhoto overflow on message screens)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the responsive layout on MessageScreen1 and MessageScreen2 so the FramedPhoto never overflows or breaks the card layout on small phones, while still looking balanced on tablet and laptop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix it it's not proper in phone",
          "Yes build it properly working in phone tab laptop etc"
        ]
      },
      "acceptanceCriteria": [
        "On a 320px-wide viewport, MessageScreen1 and MessageScreen2 display without horizontal scrolling.",
        "The framed photo (FramedPhoto component) always fits within the message card container (no clipping outside the rounded card, no overlapping the title/banner).",
        "FramedPhoto scales down on small screens and scales up appropriately on larger screens (tablet/laptop) without becoming blurry or stretched.",
        "The message card content (photo + text/balloons + CTA) remains centered and readable across common breakpoints (phone/tablet/laptop)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update FramedPhoto styling so its internal dimensions are responsive (remove fixed 300x300 behavior) while preserving the existing premium gold frame and sparkle effects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes build it properly working in phone tab laptop etc"
        ]
      },
      "acceptanceCriteria": [
        "FramedPhoto uses a responsive square size (e.g., via CSS clamp/aspect-ratio) that never exceeds its parent width.",
        "The frame padding and sparkle positions remain visually correct at small sizes (phone) and larger sizes (tablet/laptop).",
        "The image remains square-cropped (object-fit: cover) and does not distort.",
        "No regression to loading skeleton/error state visuals."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust MessageScreen1 and MessageScreen2 spacing/padding to be mobile-safe (especially within the card) while maintaining the current visual theme and animations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix it it's not proper in phone"
        ]
      },
      "acceptanceCriteria": [
        "On small phones, the card’s inner padding does not cause content to overflow vertically/horizontally; content wraps naturally.",
        "Tap-to-open interaction still works; closed state remains compact and open state reveals content smoothly.",
        "The 'Next' CTA remains fully visible and tappable without overlapping other elements at common viewport heights."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn/ui) or any path listed in frontend.immutablePaths.",
    "Keep the existing multi-screen flow and interactions unchanged aside from responsive layout/styling fixes.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new screens or changing the birthday flow logic.",
    "Implementing photo upload or backend state wiring as part of this task.",
    "Changing authentication (Internet Identity) behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}