{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Responsive fixes for MessageScreen1/2 FramedPhoto overflow (mobile/tablet/laptop)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent FramedPhoto overflow on MessageScreen1/2 and keep the message card layout centered and balanced across phone/tablet/laptop.",
      "acceptanceCriteria": [
        "On a 320px-wide viewport, MessageScreen1 and MessageScreen2 display without horizontal scrolling.",
        "The framed photo (FramedPhoto component) always fits within the message card container (no clipping outside the rounded card, no overlapping the title/banner).",
        "FramedPhoto scales down on small screens and scales up appropriately on larger screens (tablet/laptop) without becoming blurry or stretched.",
        "The message card content (photo + text/balloons + CTA) remains centered and readable across common breakpoints (phone/tablet/laptop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MessageScreen1.tsx",
          "operation": "modify",
          "description": "Adjust layout classes to be mobile-safe: reduce outer padding on small screens, make the card use responsive padding, add rounded overflow protection on the card so decorative elements never break the card boundary, and ensure the FramedPhoto container is constrained and centered without forcing a fixed width."
        },
        {
          "path": "frontend/src/pages/MessageScreen2.tsx",
          "operation": "modify",
          "description": "Adjust layout classes to be mobile-safe: reduce outer padding on small screens, make the card use responsive padding, add rounded overflow protection on the card so decorative elements never break the card boundary, and ensure the FramedPhoto container is constrained and centered without forcing a fixed width."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make FramedPhoto internally responsive (remove fixed 300×300 sizing) while preserving the gold frame, sparkle effects, and load/error visuals.",
      "acceptanceCriteria": [
        "FramedPhoto uses a responsive square size (e.g., via CSS clamp/aspect-ratio) that never exceeds its parent width.",
        "The frame padding and sparkle positions remain visually correct at small sizes (phone) and larger sizes (tablet/laptop).",
        "The image remains square-cropped (object-fit: cover) and does not distort.",
        "No regression to loading skeleton/error state visuals."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the FramedPhoto CSS rules to remove the fixed 300px width/height on .framed-photo-inner and replace with responsive sizing (using aspect-ratio and a clamped width that respects parent max-width). Also make frame padding/sparkle size/offset responsive so sparkles remain correctly positioned at different sizes, while preserving existing skeleton/error and premium gold frame effects."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Tune MessageScreen1/2 card spacing and CTA sizing to avoid mobile overflow while preserving theme and animations.",
      "acceptanceCriteria": [
        "On small phones, the card’s inner padding does not cause content to overflow vertically/horizontally; content wraps naturally.",
        "Tap-to-open interaction still works; closed state remains compact and open state reveals content smoothly.",
        "The 'Next' CTA remains fully visible and tappable without overlapping other elements at common viewport heights."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MessageScreen1.tsx",
          "operation": "modify",
          "description": "Refine spacing within the open card content (responsive spacing between photo/text) and make the 'Next' CTA sizing/spacing responsive (font size, padding, and optional full-width on small screens) so it stays visible and tappable on common phone heights while keeping existing animations and interactions."
        },
        {
          "path": "frontend/src/pages/MessageScreen2.tsx",
          "operation": "modify",
          "description": "Refine spacing within the open card content (responsive spacing between photo/balloons/text) and make the 'Next' CTA sizing/spacing responsive (font size, padding, and optional full-width on small screens) so it stays visible and tappable on common phone heights while keeping existing animations and interactions."
        }
      ]
    }
  ]
}